[
  {
    "event_id": "1102",
    "description": "The audit log was cleared",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=1102",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND metadata.product_event_type = \"1102\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 1102",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_1102>"
    }
  },
  {
    "event_id": "4625",
    "description": "Failed account Logon",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4625",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND security_result.action = \"FAIL\" AND metadata.product_event_type = \"4625\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4625",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4625>"
    }
  },
  {
    "event_id": "4624",
    "description": "Successful account Logon",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4624",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND security_result.action = \"SUCCESS\" AND metadata.product_event_type = \"4624\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4624",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4624>"
    }
  },
  {
    "event_id": "4688",
    "description": "A new process has been created",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4688",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND metadata.product_event_type = \"4688\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4688",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4688>"
    }
  },
  {
    "event_id": "4720",
    "description": "A user account was created",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4720",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND metadata.product_event_type = \"4720\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4720",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4720>"
    }
  },
  {
    "event_id": "4719",
    "description": "System audit policy was changed",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4719",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND metadata.product_event_type = \"4719\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4719",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4719>"
    }
  },
  {
    "event_id": "4649",
    "description": "A replay attack was detected",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4649",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND metadata.product_event_type = \"4649\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4649",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4649>"
    }
  },
  {
    "event_id": "4765",
    "description": "SID History was added to an account",
    "siem_queries": {
      "Splunk": "index=wineventlog EventCode=4765",
      "GoogleSecOps": "metadata.event_type = \"WINDOWS_EVENT\" AND metadata.product_event_type = \"4765\"",
      "MicrosoftSentinel": "SecurityEvent | where EventID == 4765",
      "QRadar": "SELECT * FROM events WHERE LOGSOURCETYPENAME(devicetype) = 'Microsoft Windows Security Event Log' AND QIDNUMBER(qid) = <QID_for_4765>"
    }
  }
]
